#+title: Youtube mpv browser extension

A browser extension to play youtube video from [[https://mpv.io/][mpv]] (with the help of [[https://github.com/yt-dlp/yt-dlp][yt-dlp]]) via [[https://developer.chrome.com/docs/extensions/develop/concepts/native-messaging#native-messaging-host-protocol][native messaging protocol]].
It is still a very rough MVP. Play with it at yout own risk.
* Build
We need to compile a both the =extension= and the =native host application= wrapping mpv which the extension messaging to.
** Nix
We can use nix
*** Install [[https://nixos.org/download.html][nix]]
*** To build
#+begin_src
nix build
#+end_src
- The directory for the extension :: ./result/share/chrome/extensions
- The native host application :: ./result/bin/youtube-mpv-native-host

** Non-Nix
*** The extension
**** Install [[https://www.typescriptlang.org/download][typescript]] if you don't have it.
To check if you have got tsc and fyi my tsc version.
#+begin_src bash :exports both
tsc -v
#+end_src

#+RESULTS:
: Version 5.2.2

**** Compile the extension, run
#+begin_src bash :dir ./extension :results scalar :exports both
pwd
pnpm i # NOTE: pnpm can be replaced with npm, yarn, etc
tsc
#+end_src

#+RESULTS:
#+begin_example
/Users/fanshi/Personal/chrome-extensions/youtube-mpv/extension
Lockfile is up to date, resolution step is skipped
Progress: resolved 1, reused 0, downloaded 0, added 0
Packages: +4
++++
Progress: resolved 4, reused 4, downloaded 0, added 4, done

devDependencies:
+ @types/chrome 0.0.254

Done in 865ms
#+end_example

Newly compiled js will be inside [[file:extension/dist/][./extension/dist]], now this is your extension.
*** The native host application
**** Install ghc + cabal if you don't have it
Probably use [[https://www.haskell.org/ghcup/][ghcup]] to install them.
To check if you have got ghc/cabal and fyi my ghc/cabal version.

#+begin_src bash :exports both :results scalar
ghc --version
cabal --version
#+end_src

#+RESULTS:
: The Glorious Glasgow Haskell Compilation System, version 9.6.3
: cabal-install version 3.10.2.1
: compiled using version 3.10.2.1 of the Cabal library

**** Compile the native host
#+begin_src bash :dir ./native-host :results scalar :exports both
pwd
cabal build -O2
#+end_src

#+RESULTS:
#+begin_example
/Users/fanshi/Personal/chrome-extensions/youtube-mpv/native-host
Resolving dependencies...
Build profile: -w ghc-9.6.3 -O2
In order, the following will be built (use -v for more details):
 - youtube-mpv-native-host-0.1.0.0 (exe:youtube-mpv-native-host) (first run)
Configuring executable 'youtube-mpv-native-host' for youtube-mpv-native-host-0.1.0.0..
Preprocessing executable 'youtube-mpv-native-host' for youtube-mpv-native-host-0.1.0.0..
Building executable 'youtube-mpv-native-host' for youtube-mpv-native-host-0.1.0.0..
[1 of 1] Compiling Main             ( app/Main.hs, /Users/fanshi/Personal/chrome-extensions/youtube-mpv/native-host/dist-newstyle/build/x86_64-osx/ghc-9.6.3/youtube-mpv-native-host-0.1.0.0/x/youtube-mpv-native-host/opt/build/youtube-mpv-native-host/youtube-mpv-native-host-tmp/Main.o )
[2 of 2] Linking /Users/fanshi/Personal/chrome-extensions/youtube-mpv/native-host/dist-newstyle/build/x86_64-osx/ghc-9.6.3/youtube-mpv-native-host-0.1.0.0/x/youtube-mpv-native-host/opt/build/youtube-mpv-native-host/youtube-mpv-native-host
#+end_example

***** To find the path to the compiled executable, and fyi mine is at
#+begin_src bash :dir ./native-host :exports both :results scalar
pwd
cabal list-bin -O2 youtube-mpv-native-host
#+end_src

#+RESULTS:
: /Users/fanshi/Personal/chrome-extensions/youtube-mpv/native-host
: /Users/fanshi/Personal/chrome-extensions/youtube-mpv/native-host/dist-newstyle/build/x86_64-osx/ghc-9.6.3/youtube-mpv-native-host-0.1.0.0/x/youtube-mpv-native-host/opt/build/youtube-mpv-native-host/youtube-mpv-native-host

*** Hey, of course
You need a browser([[https://www.google.com/chrome/][Chrome]] for example) and [[https://mpv.io/][Mpv]] + [[https://github.com/yt-dlp/yt-dlp/wiki/Installation][yt-dlp]] (and [[https://mpv.io/manual/stable/#options-ytdl-path][to setup ytdl path for mpv as needed]])
* Setup
*** To register a native messaging host
- https://developer.chrome.com/docs/extensions/develop/concepts/native-messaging#native-messaging-host
- fyi I make the file at ~/Library/Application Support/Google/Chrome/NativeMessagingHosts/youtube.mpv.json, [[https://developer.chrome.com/docs/extensions/develop/concepts/native-messaging#native-messaging-host-location][but your location might be different.]]
#+begin_src json
{
  "name": "youtube.mpv",
  "description": "play youtube with mpv",
  "path": "${path to your compiled native host executable}",
  "type": "stdio",
  "allowed_origins": ["chrome-extension://${extension-id}/"]
}
#+end_src
*** To load the extension
- [[https://developer.chrome.com/docs/extensions/get-started/tutorial/hello-world#load-unpacked][Load it unpacked]]
- Or :: [[https://developer.chrome.com/docs/extensions/how-to/distribute/host-extensions#create][Pack it]].
*** To Configure mpv behaviour
You can setup a [youtube-mpv] profile, see https://mpv.io/manual/master/#profiles
* Usage
Turn on the extension and goto [[https://youtube.com][youtube]], click on any video and see it youself (via =mpv= of course).
* Contributing
PRs accepted
* License
[[file:LICENSE][MIT © fanshi1028]]
